In [1]:
import numpy as np
import pandas as pd

In [13]:
rng = np.random.RandomState(0)
df = pd.DataFrame({"key" : ["A","B","A","D","B","D"],
"data1":range(6),
"data2":rng.randint(0,16,6)},
columns = ["key","data1","data2"]
)
df

  key  data1  data2
0   A      0     12
1   B      1     15
2   A      2      5
3   D      3      0
4   B      4      3
5   D      5     11

In [14]:
df.groupby("key").aggregate({"data1":"min","data2":"max"
})   #Group BY with dictionary

     data1  data2
key
A        0     12
B        1     15
D        3     11

In [10]:
#FILTER

In [15]:
df

  key  data1  data2
0   A      0     12
1   B      1     15
2   A      2      5
3   D      3      0
4   B      4      3
5   D      5     11

In [16]:
df.groupby("key").std()

        data1     data2
key
A    1.414214  4.949747
B    2.121320  8.485281
D    1.414214  7.778175

In [25]:
display(df,df.mean(),df.groupby('key').std())

C:\Users\bozta\AppData\Local\Temp/ipykernel_19992/2661263660.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  display(df,df.mean(),df.groupby('key').std())

  key  data1  data2
0   A      0     12
1   B      1     15
2   A      2      5
3   D      3      0
4   B      4      3
5   D      5     11

data1    2.500000
data2    7.666667
dtype: float64

        data1     data2
key
A    1.414214  4.949747
B    2.121320  8.485281
D    1.414214  7.778175

In [27]:
df.groupby("key").transform(lambda x: x-x.mean())

   data1  data2
0   -1.0    3.5
1   -1.5    6.0
2    1.0   -3.5
3   -1.0   -5.5
4    1.5   -6.0
5    1.0    5.5